from abc import ABC,abstractmethod
class LibraryItem(ABC):#يمثل اي عنصر موجود في المكتبة سواء كان كتاب او قرص او مجلة
    
    def __init__(self,item_id:int,title:str,author:str):# الخصائص اللى كل عنصر(الكلاسات اللى بيورثوا من هذا الكلاس ) مشترك فيها
        self.item_id=item_id
        # رقم الاي دي للعنصر او المستخدم 
        #: الهدف منه : تمييز كل مستخدم عن الآخر حتى لو كان عندهم نفس الاسم.مثلا
        self.title=title
        self.author=author
        self.available=True#نفترض انه العنصر موجود وجاهز للاستعارة اول ما نضيفه
        
    @abstractmethod #بتعرض معلومات العنصر
    def display_info(self):#  لازم اي كلاس يرث هاي الدالة يكتب تعريفها بنفسه
        #كل عنصر اله عنوان ومؤلف بس طريقة العرض ممكن تختلف لانه بدنا نضيف خصائص خاصة بكل عنصر
        pass
    
    def check_availability(self): #بترجع اذا العنصر متاح للاستعارة (ترو او فولس )
        # بترجع العنصر اذا متوفر للاستعارة او مشغول
        #يعني اذا  رجع ترو يعني بتقدر تستعير العنصر
        #واذا فولس  بيكون محجوز
        return self.available
    # فيه 3 حالات مهمات 
    
    #1.    self.available=Trueلو انا روحت حذفت المتغير هذا 
    #راح يظهر ايرور انه انت بالدالة هاي بترجع متغير وقيمته وهو مش موجود 
    
    #2.self.available=True لو انا حذفت self 
    # ببطل الكائن يأشر على هذا المتغير 
    
    #3. return true  لو عملت بالدالة هيك 
    #ببطل اعدل على قيمتها يعني ببطل اخليه انه مستعار وهيك 